var fi = [0, 1, 3, 4, 5, 9, 17, 18, 22, 24, 25, 26, 27];
// length of the array = 13
console.log(fi.length); 

var newHeader = ["ผู้ขอรับบริการ",	"เลขที่ยืนยันตัวตน", "เลขที่ยืนยันตัวตน (นิติบุคคล)","หมายเลขโทรศัพท์","อีเมล","ชื่อนิติบุคคล","ผู้ให้บริการ","ผลิตภัณฑ์","สถานะบัญชี","เลขที่ทะเบียนรถ","จังหวัดที่จดทะเบียนรถ", "แนวทางที่ต้องการเสนอให้ผู้บริการทางการเงินพิจารณา", "เลขที่บัตร/ เลขที่สัญญา", "ผลการพิจารณา", "แนวทางการช่วยเหลือลูกหนี้", "เหตุผลที่ไม่สามารถช่วยเหลือลูกหนี้ได้", "เงินต้น (บาท)", "วันที่ทำสัญญา","ข้อมูลที่ต้องการแจ้ง ธปท. เพิ่มเติม (ถ้ามี)","วันที่รับคำขอ"];

var walkin = ["ขอรับบริการในนาม", "ผู้ติดต่อ", "ผู้ขอรับบริการ", "ประเภทเลขที่ยืนยันตัวตน", "ประเภทเลขที่ยืนยันตัวตน (นิติบุคคล)", "เลขที่ยืนยันตัวตน", "เลขที่ยืนยันตัวตน (นิติบุคคล)", "หมายเลขโทรศัพท์", "อีเมล", "จังหวัด (ที่อยู่ลูกหนี้)", "ชื่อนิติบุคคล", "ผู้ให้บริการ", "ผลิตภัณฑ์", "สถานะบัญชี", "เลขที่ทะเบียนรถ", "จังหวัดที่จดทะเบียนรถ", "แนวทางที่ต้องการเสนอให้ผู้บริการทางการเงินพิจารณา", "เลขที่บัตร/ เลขที่สัญญา", "วันที่เริ่มติดต่อลูกหนี้", "ผลการพิจารณา", "แนวทางการช่วยเหลือลูกหนี้", "เหตุผลที่ไม่สามารถช่วยเหลือลูกหนี้ได้", "ภาระหนี้รวม (บาท)", "เงินต้น (บาท)", "ภาระหนี้ที่ตกลงชำระ (บาท)", "จำนวนงวดที่ชำระ (เดือน)", "ค่างวดต่อเดือน (บาท)", "รายงาน RDT", "วันที่ทำสัญญา", "ข้อมูลที่ต้องการแจ้ง ธปท. เพิ่มเติม (ถ้ามี)", "วันที่รับคำขอ"];
// what in wlakin is not in newHeader
var diff = walkin.filter(x => !newHeader.includes(x));
// console.log(diff);

var diff2 = ['ขอรับบริการในนาม','ผู้ติดต่อ','ประเภทเลขที่ยืนยันตัวตน','ประเภทเลขที่ยืนยันตัวตน (นิติบุคคล)','จังหวัด (ที่อยู่ลูกหนี้)','วันที่เริ่มติดต่อลูกหนี้','ภาระหนี้รวม (บาท)','ภาระหนี้ที่ตกลงชำระ (บาท)','จำนวนงวดที่ชำระ (เดือน)','ค่างวดต่อเดือน (บาท)','รายงาน RDT'];

// what in wlakin is not in newHeader index version statring from 0
var diffIndex = diff2.map(x => walkin.indexOf(x));
console.log(diffIndex);

var codeDiff = [0,  1,  3,  4,  9, 18, 22, 24, 25, 26, 27];
var diff2 = ['ขอรับบริการในนาม','ผู้ติดต่อ','ประเภทเลขที่ยืนยันตัวตน','ประเภทเลขที่ยืนยันตัวตน (นิติบุคคล)','จังหวัด (ที่อยู่ลูกหนี้)','วันที่เริ่มติดต่อลูกหนี้','ภาระหนี้รวม (บาท)','ภาระหนี้ที่ตกลงชำระ (บาท)','จำนวนงวดที่ชำระ (เดือน)','ค่างวดต่อเดือน (บาท)','รายงาน RDT'];



